<a href="https://colab.research.google.com/github/Degananda264/Data-Preprocessing/blob/master/Data_preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [54]:
df=pd.read_csv("/content/Sample_real_estate_data.csv")

In [55]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000.0
1  100002000.0   197.0   LEXINGTON            N            3      1.5   100.0
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN            1      NaN   700.0
4          NaN   203.0    BERKELEY            Y            3        2  1600.0
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y            1        1     NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800.0

In [56]:
df['NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [57]:
missing_values=['n/a','na','NA','--']
df=pd.read_csv("/content/Sample_real_estate_data.csv",na_values=missing_values)

In [58]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5   100.0
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [59]:
df['NUM_BATH'].dtypes

dtype('O')

In [60]:
type(df['NUM_BATH'][0])

str

In [61]:
df.loc[6,'NUM_BATH']=np.nan

In [62]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5   100.0
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [63]:

from sklearn.impute import SimpleImputer

X = df.iloc[:,:-1].values
Y = df.iloc[:,6]
imput = SimpleImputer(missing_values = np.nan, strategy= 'mean')
imput = imput.fit(X[:,1:2])
X[:,1:2] = imput.transform(X[:,1:2])
X[:,1:2]

array([[104.0],
       [197.0],
       [191.42857142857142],
       [201.0],
       [203.0],
       [207.0],
       [191.42857142857142],
       [213.0],
       [215.0]], dtype=object)

In [64]:
df['ST_NUM']= X[:,1:2]

In [65]:
df['ST_NUM']

0        104
1        197
2    191.429
3        201
4        203
5        207
6    191.429
7        213
8        215
Name: ST_NUM, dtype: object

In [66]:
df

           PID   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0      104      PUTNAM            Y           3.0        1  1000.0
1  100002000.0      197   LEXINGTON            N           3.0      1.5   100.0
2  100003000.0  191.429   LEXINGTON            N           NaN        1   850.0
3  100004000.0      201    BERKELEY          NaN           1.0      NaN   700.0
4          NaN      203    BERKELEY            Y           3.0        2  1600.0
5  100006000.0      207    BERKELEY            Y           NaN        1   800.0
6  100007000.0  191.429  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0      213     TREMONT            Y           1.0        1     NaN
8  100009000.0      215     TREMONT            Y           NaN        2  1800.0

In [67]:
median=df['SQ_FT'].median()

In [68]:
df['SQ_FT'].fillna(median,inplace=True)

In [69]:
df

           PID   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0      104      PUTNAM            Y           3.0        1  1000.0
1  100002000.0      197   LEXINGTON            N           3.0      1.5   100.0
2  100003000.0  191.429   LEXINGTON            N           NaN        1   850.0
3  100004000.0      201    BERKELEY          NaN           1.0      NaN   700.0
4          NaN      203    BERKELEY            Y           3.0        2  1600.0
5  100006000.0      207    BERKELEY            Y           NaN        1   800.0
6  100007000.0  191.429  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0      213     TREMONT            Y           1.0        1   900.0
8  100009000.0      215     TREMONT            Y           NaN        2  1800.0